New_benchmarking_log.txt

# ab -n 1000 -c 50 http://ec2-35-160-140-143.us-west-2.compute.amazonaws.com//?keywords=helloworld+foo+bar

This is ApacheBench, Version 2.3 <$Revision: 1748469 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking ec2-35-160-140-143.us-west-2.compute.amazonaws.com (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        WSGIServer/0.1
Server Hostname:        ec2-35-160-140-143.us-west-2.compute.amazonaws.com
Server Port:            80

Document Path:          //?keywords=helloworld+foo+bar
Document Length:        774 bytes

Concurrency Level:      50
Time taken for tests:   113.498 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      936000 bytes
HTML transferred:       774000 bytes
Requests per second:    8.81 [#/sec] (mean)
Time per request:       5674.876 [ms] (mean)
Time per request:       113.498 [ms] (mean, across all concurrent requests)
Transfer rate:          8.05 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       82  113  32.5    104     415
Processing:   112 5414 724.6   5517    6440
Waiting:      100 2839 1584.2   2838    6130
Total:        222 5527 724.6   5628    6543

Percentage of the requests served within a certain time (ms)
  50%   5628
  66%   5703
  75%   5750
  80%   5777
  90%   5875
  95%   6114
  98%   6335
  99%   6411
 100%   6543 (longest request)